In [1]:
import pandas as pd

In [2]:
dataset={ 'student':['Vivek','Sanil','Gaurav','Chauhan'],
        'addmission':[2022,2023,2024,2025]}
demo=pd.DataFrame(dataset)
print(demo)

   student  addmission
0    Vivek        2022
1    Sanil        2023
2   Gaurav        2024
3  Chauhan        2025

In [3]:
print(pd.__version__)

1.4.2

In [4]:
a=[100,200,300,400]
demo1=pd.Series(a)
print(demo1)
print(demo1[2])

0    100
1    200
2    300
3    400
dtype: int64
300

In [5]:
demo2=pd.Series(a,index=["m1","m2","m3","m4"])
print(demo2)

m1    100
m2    200
m3    300
m4    400
dtype: int64

In [6]:
print(demo2["m2"])

200

In [7]:
v1={"Car":"Mastang GT","House":"Big Menstion","Travel":"Across The World"}
v1=pd.Series(v1)
print(v1)

Car             Mastang GT
House         Big Menstion
Travel    Across The World
dtype: object

In [8]:
print(v1["Car"])

Mastang GT

In [9]:
v2=pd.Series(v1,index=["Travel"])
print(v2)

Travel    Across The World
dtype: object

In [10]:
My_Goal={"Car":"Mastang GT","House":"Big Menstion","Travel":"Across The World"}
My_Goal=pd.Series(My_Goal)
print(My_Goal)

Car             Mastang GT
House         Big Menstion
Travel    Across The World
dtype: object

In [11]:
data={"product":["chocolate","puff","wafers"],
      "price":[50,20,10]}
dataFr=pd.DataFrame(data)
print(dataFr)

     product  price
0  chocolate     50
1       puff     20
2     wafers     10

In [12]:
print(dataFr.loc[0])

product    chocolate
price             50
Name: 0, dtype: object

In [13]:
StMarks=pd.read_csv('Marks.csv')
print(StMarks)

   Roll No     Name  Total marks  Achived
0        1    Vivek          500      499
1        2    Sanil          500      493
2        3   Gaurav          500      492
3        4    Parth          500      494
4        5  Prabhat          500      500
5        6  Pruthvi          500      495

In [14]:
print(pd.options.display.max_rows)

60

In [15]:
pd.options.display.max_rows=4
stud_marks=pd.read_csv('Marks.csv')
(stud_marks)

    Roll No     Name  Total marks  Achived
0         1    Vivek          500      499
1         2    Sanil          500      493
..      ...      ...          ...      ...
4         5  Prabhat          500      500
5         6  Pruthvi          500      495

[6 rows x 4 columns]

In [18]:
stu=pd.read_csv('Marks.csv')
print(stu)

    Roll No     Name  Total marks  Achived
0         1    Vivek          500      499
1         2    Sanil          500      493
..      ...      ...          ...      ...
4         5  Prabhat          500      500
5         6  Pruthvi          500      495

[6 rows x 4 columns]

In [20]:
(stu.head())

    Roll No     Name  Total marks  Achived
0         1    Vivek          500      499
1         2    Sanil          500      493
..      ...      ...          ...      ...
3         4    Parth          500      494
4         5  Prabhat          500      500

[5 rows x 4 columns]

In [22]:
(stu.tail())

    Roll No     Name  Total marks  Achived
1         2    Sanil          500      493
2         3   Gaurav          500      492
..      ...      ...          ...      ...
4         5  Prabhat          500      500
5         6  Pruthvi          500      495

[5 rows x 4 columns]

In [23]:
print(stu.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Roll No      6 non-null      int64
 1   Name         6 non-null      object
 2   Total marks  6 non-null      int64
 3   Achived      6 non-null      int64
dtypes: int64(3), object(1)
memory usage: 320.0+ bytes
None

In [24]:
stu1=pd.read_csv('newmarks.csv')
print(stu1)

    Roll No     Name  Total marks  Achived
0         1    Vivek          500    499.0
1         2    Sanil          500    493.0
..      ...      ...          ...      ...
4         5    Sonal          500      NaN
5         6  Pruthvi          500      NaN

[6 rows x 4 columns]

In [25]:
stu1=stu1.dropna() 
stu1.dropna(inplace=True)
print(stu1)

   Roll No   Name  Total marks  Achived
0        1  Vivek          500    499.0
1        2  Sanil          500    493.0
3        4  Parth          500    494.0